### Review Lecture 2/23

- partner assignments
- iloc vs loc
- apply vs transform vs agg
- groupby
- review HW 4 and give hints

In [76]:
import pandas as pd
import numpy as np
df = pd.DataFrame({'Title': ['Avatar', 'Avengers', 'Terminator', 'Matrix', 'Jurassic Park'], 
                   'Rating': [8.0, 9.0, 10.0, np.nan, 8.0], 
                   'Genre': ['SciFi', 'Action', 'Action', 'SciFi', 'Action'],
                   'Date Released': ['1/1/2020', '1/5/1997', '2/1/2012', '1/6/2008', '9/1/2005']})
df

           Title  Rating   Genre Date Released
0         Avatar     8.0   SciFi      1/1/2020
1       Avengers     9.0  Action      1/5/1997
2     Terminator    10.0  Action      2/1/2012
3         Matrix     NaN   SciFi      1/6/2008
4  Jurassic Park     8.0  Action      9/1/2005

In [9]:
df.dtypes

Title             object
Rating           float64
Genre             object
Date Released     object
dtype: object

In [7]:
df['Title']

0           Avatar
1         Avengers
2       Terminator
3           Matrix
4    Jurassic Park
Name: Title, dtype: object

In [8]:
type(df['Title'])

pandas.core.series.Series

Differences between iloc and loc

- loc (label based) - look at the left-most column
- iloc (index based) - based on counting

In [16]:
df.iloc[0]

Title              Avatar
Rating                  8
Genre               SciFi
Date Released    1/1/2020
Name: 0, dtype: object

In [17]:
df.index = [x for x in range(1,6)]
df

           Title  Rating   Genre Date Released
1         Avatar     8.0   SciFi      1/1/2020
2       Avengers     9.0  Action      1/5/1997
3     Terminator    10.0  Action      2/1/2012
4         Matrix     NaN   SciFi      1/6/2008
5  Jurassic Park     8.0  Action      9/1/2005

In [21]:
df.loc[1]

Title              Avatar
Rating                  8
Genre               SciFi
Date Released    1/1/2020
Name: 1, dtype: object

In [22]:
df = df.set_index('Title')
df

               Rating   Genre Date Released
Title
Avatar            8.0   SciFi      1/1/2020
Avengers          9.0  Action      1/5/1997
Terminator       10.0  Action      2/1/2012
Matrix            NaN   SciFi      1/6/2008
Jurassic Park     8.0  Action      9/1/2005

In [32]:
df.loc['Avatar', 'Rating']

8.0

In [33]:
df.loc['Avatar']['Rating']

8.0

In [41]:
df.loc[['Avatar', 'Avengers'], ['Genre', 'Rating']]

           Genre  Rating
Title
Avatar     SciFi     8.0
Avengers  Action     9.0

In [42]:
df.iloc[0, 1]

'SciFi'

In [46]:
df.iloc[2:4, 0:2].loc['Terminator']

Rating        10
Genre     Action
Name: Terminator, dtype: object

In [47]:
df

               Rating   Genre Date Released
Title
Avatar            8.0   SciFi      1/1/2020
Avengers          9.0  Action      1/5/1997
Terminator       10.0  Action      2/1/2012
Matrix            NaN   SciFi      1/6/2008
Jurassic Park     8.0  Action      9/1/2005

apply, applymap, transform, agg, groupby

In [51]:
def mystery(x):
    print(x['Rating'])

df.apply(mystery, axis = 1)

8.0
9.0
10.0
nan
8.0

Title
Avatar           None
Avengers         None
Terminator       None
Matrix           None
Jurassic Park    None
dtype: object

In [52]:
def function(x):
    return 0

df.applymap(function)

               Rating  Genre  Date Released
Title
Avatar              0      0              0
Avengers            0      0              0
Terminator          0      0              0
Matrix              0      0              0
Jurassic Park       0      0              0

In [54]:
df

               Rating   Genre Date Released
Title
Avatar            8.0   SciFi      1/1/2020
Avengers          9.0  Action      1/5/1997
Terminator       10.0  Action      2/1/2012
Matrix            NaN   SciFi      1/6/2008
Jurassic Park     8.0  Action      9/1/2005

In [62]:
import re
def get_year(row):
    pattern = '(\d+)/(\d+)/(\d+)'
    x = re.findall(pattern, row['Date Released'])
    #x = row['Date Released'].split('/')
    return x[0][-1]
    

df.apply(get_year, axis=1)

Title
Avatar           2020
Avengers         1997
Terminator       2012
Matrix           2008
Jurassic Park    2005
dtype: object

In [63]:
df

               Rating   Genre Date Released
Title
Avatar            8.0   SciFi      1/1/2020
Avengers          9.0  Action      1/5/1997
Terminator       10.0  Action      2/1/2012
Matrix            NaN   SciFi      1/6/2008
Jurassic Park     8.0  Action      9/1/2005

In [70]:
for group, frame in df.groupby('Genre'):
    print(group, frame)

Action                Rating   Genre Date Released
Title
Avengers          9.0  Action      1/5/1997
Terminator       10.0  Action      2/1/2012
Jurassic Park     8.0  Action      9/1/2005
SciFi         Rating  Genre Date Released
Title
Avatar     8.0  SciFi      1/1/2020
Matrix     NaN  SciFi      1/6/2008

In [71]:
for group, frame in df.groupby('Genre'):
    mask = frame['Rating'] == frame['Rating'].max()
    highest_rating_movie = frame[mask]
    print(highest_rating_movie)

            Rating   Genre Date Released
Title
Terminator    10.0  Action      2/1/2012
        Rating  Genre Date Released
Title
Avatar     8.0  SciFi      1/1/2020

In [80]:
#df = df.dropna()
df

           Title  Rating   Genre Date Released
0         Avatar     8.0   SciFi      1/1/2020
1       Avengers     9.0  Action      1/5/1997
2     Terminator    10.0  Action      2/1/2012
3         Matrix     NaN   SciFi      1/6/2008
4  Jurassic Park     8.0  Action      9/1/2005

`agg` creates a table of summary statistics depending on what columns you specify (can pass in a function, or a dictionary)

In [77]:
df.groupby('Genre').agg({'Rating': np.nanmean})

        Rating
Genre
Action     9.0
SciFi      8.0

`transform` is useful when you want to attach an additional column to your existing dataframe (can pass in a function)

In [79]:
df.groupby('Genre').transform(np.nanmean)

   Rating
0     8.0
1     9.0
2     9.0
3     8.0
4     9.0

In [86]:
df = df.rename(columns={'Rating': 'Critic Rating'})
df

           Title  Critic Rating   Genre Date Released  Group Means
0         Avatar            8.0   SciFi      1/1/2020          8.0
1       Avengers            9.0  Action      1/5/1997          9.0
2     Terminator           10.0  Action      2/1/2012          9.0
3         Matrix            NaN   SciFi      1/6/2008          8.0
4  Jurassic Park            8.0  Action      9/1/2005          9.0

In [94]:
df['Audience Rating'] = [10, 10, 9, '9', 8]

In [90]:
df = df.drop('Group Means', axis=1)

In [95]:
df

           Title  Critic Rating   Genre Date Released Audience Rating
0         Avatar            8.0   SciFi      1/1/2020              10
1       Avengers            9.0  Action      1/5/1997              10
2     Terminator           10.0  Action      2/1/2012               9
3         Matrix            NaN   SciFi      1/6/2008               9
4  Jurassic Park            8.0  Action      9/1/2005               8

In [96]:
df.dtypes

Title               object
Critic Rating      float64
Genre               object
Date Released       object
Audience Rating     object
dtype: object

In [97]:
df.groupby('Genre').transform(np.nanmean)

   Critic Rating
0            8.0
1            9.0
2            9.0
3            8.0
4            9.0

In [98]:
df = df.reset_index()
df

   index          Title  Critic Rating   Genre Date Released Audience Rating
0      0         Avatar            8.0   SciFi      1/1/2020              10
1      1       Avengers            9.0  Action      1/5/1997              10
2      2     Terminator           10.0  Action      2/1/2012               9
3      3         Matrix            NaN   SciFi      1/6/2008               9
4      4  Jurassic Park            8.0  Action      9/1/2005               8